### 데이터프레임
-   DF는 Series로 이루어져있다.
-   다른 언어와 달리 열-행 순서로 작업***
-   열(column) 중심!!!
-   슬라이싱은 실전에서 잘 사용하지 않음

In [37]:
import numpy as np
import pandas as pd

- 생성방법 1: 2차원 데이터, 컬럼 명, (인덱스)

In [38]:
df1 = pd.DataFrame(
    np.random.randint(40, 101, 12).reshape(4, 3),    # 2차원 데이터(반드시 있어야 함)
    columns=list('XYZ'),                           # 컬럼 명(리스트로 줌)
    index=list('abcd')
)
df1

    X   Y   Z
a  79  67  86
b  76  93  88
c  69  99  71
d  67  72  66

- 생성방법 2: 딕셔너리의 리스트

In [39]:
data = [
    {'X': 83, 'Y':59, 'Z':53 },
    {'X': 45, 'Y':59, 'Z':45 },
    {'X': 50, 'Y':89, 'Z':86 },
    {'X': 100, 'Y':46, 'Z':77 }
]
df2 = pd.DataFrame(data, index=list('abcd'))
df2

     X   Y   Z
a   83  59  53
b   45  59  45
c   50  89  86
d  100  46  77

- 생성방법 3: 데이터가 value, 컬럼명이 key가 되는 딕셔너리

In [40]:
data = {
    'X': [83, 45, 50, 100],
    'Y': [59, 59, 89, 46],
    'Z': [53, 45, 86, 77]
}
df3 = pd.DataFrame(data, index=list('abcd'))
df3

     X   Y   Z
a   83  59  53
b   45  59  45
c   50  89  86
d  100  46  77

In [41]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [42]:
df.values       # data가 문자열, 정수, 실수 섞여있음 => dtype=object로 나옴

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [43]:
df.columns  # 열의 이름

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [44]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [45]:
# name은 DF생성 전후에 줘도 상관없음
df.index.name = '도시'
df.columns.name = '항목'
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.

(1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.

(2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [46]:
data = {
    'a': [83, 45, 50, 100, 0],
    'b': [59, 59, 89, 46, 9],
    'c': [53, 45, 86, 77, 10],
    'd': ['티', '안경', '마우스', '초콜릿', '사탕'],
    'e': [0.1, 0.2, 0.3, 0.4, 0.5]
}
dfj = pd.DataFrame(data, index=list('iouyk'))
dfj

     a   b   c    d    e
i   83  59  53    티  0.1
o   45  59  45   안경  0.2
u   50  89  86  마우스  0.3
y  100  46  77  초콜릿  0.4
k    0   9  10   사탕  0.5

In [47]:
chr(65) + chr(90)   # AZ 출력 -> 아스키코드 값

'AZ'

```
동일한 DF을 2가지 ver으로 만들어보기
```

In [48]:
# 방법 1)
col_A, col_B, col_C, col_D, col_E = [], [], [], [], []
np.random.seed= 2023
for i in range(5):
    col_A.append(chr(np.random.randint(65, 91)) + chr(np.random.randint(65, 91)))
    col_B.append(np.random.randint(1, 7))
    col_C.append(np.random.randint(40, 101))
    col_D.append(np.random.randint(1, 100)* 1000)
    col_E.append(np.round(np.random.rand(), 4)) # 소수점 4자리까지 출력
df4 = pd.DataFrame(
    {'col_A':col_A, 'col_B':col_B, 'col_C':col_C, 'col_D':col_D, 'col_E':col_E}
)
df4

  col_A  col_B  col_C  col_D   col_E
0    CP      2     82  89000  0.1955
1    YS      1     91  36000  0.2042
2    IQ      2     68   5000  0.9349
3    EL      3     83  17000  0.6462
4    XC      4     82  25000  0.7108

In [49]:
# 방법2) 리스트 안에 딕셔너리 넣기
# 빈리스트 만듦-> 반복문 안에서 딕셔너리를 만듦-> 리스트에 append하기 
data = []
for i in range(5):
    d = {
        'col_A':chr(np.random.randint(65, 91)) + chr(np.random.randint(65, 91)),
        'col_B':np.random.randint(1, 7),
        'col_C':np.random.randint(40, 101),
        'col_D':np.random.randint(1, 100)* 1000,
        'col_E':np.round(np.random.rand(), 4)
    }
    data.append(d)
df5 = pd.DataFrame(data)
df5

  col_A  col_B  col_C  col_D   col_E
0    WM      1     49  58000  0.4488
1    RO      2     95  62000  0.6460
2    FC      6     52  76000  0.7333
3    IR      3     57  46000  0.7593
4    ZT      6     69  44000  0.5985

- Transpose(전치)

In [50]:
df1.T

    a   b   c   d
X  79  76  69  67
Y  67  93  99  72
Z  86  88  71  66

In [51]:
df5.T   # 정상적인 방법은 x 데이터타입이 섞여버림.

            0      1       2       3       4
col_A      WM     RO      FC      IR      ZT
col_B       1      2       6       3       6
col_C      49     95      52      57      69
col_D   58000  62000   76000   46000   44000
col_E  0.4488  0.646  0.7333  0.7593  0.5985

- 열 데이터의 갱신, 추가, 삭제

In [52]:
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [53]:
df['2010-2015 증가율'] = df['2010-2015 증가율'] * 100
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [54]:
# 표에 이미 있는 열이면 갱신, 없으면 새로 생성
df['2005-2010 증가율'] = ((df['2010']- df['2005']) /df['2005'] * 100).round(2)  # round값설정 안하면 소수점6자리까지 출력됨
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [55]:
# 열 삭제
del df['2010-2015 증가율']
df

항목   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

- 열 인덱싱

In [56]:
df['지역']  # 열 이름 하나 지정 -> Serie값 반환

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [57]:
df[['2015','2010']]     # 열 이름을 여러개 리스트로 지정 -> DF 반환

항목     2015     2010
도시
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [58]:
df[['2015']]        # 한개를 리스트로 지정 -> DF로 반환

항목     2015
도시
서울  9904312
부산  3448737
인천  2890451
대구  2466052

- 개별 인덱싱

In [63]:
# [열이름][행인덱스], .notation 등 가능
df['지역']['서울'], df.지역['서울'], df.지역.서울

('수도권', '수도권', '수도권')

In [ ]:
# 닷 노테이션 불가한 경우: 컬럼명이 숫자인 경우/ 컬럼명에 스페이스가 들어가있는 경우
df['2015']['서울'], df.2015['서울'], df.2015.서울

- 연습문제 4.1.3

In [68]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [70]:
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [71]:
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [74]:
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df['평균'] = ((df.국어+df.영어+df.수학) / 3).round(1)  # 또는 (df['국어']+df['영어']+df['수학'])
df

    국어  영어  수학   평균점수
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [94]:
# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
import warnings
warnings.filterwarnings('ignore')
df['영어']['방자']= 80
df['평균'] = ((df.국어+df.영어+df.수학) / 3).round(1)
df

    국어  영어  수학   평균점수    평균
춘향  80  90  90  86.67  86.7
몽룡  90  70  60  73.33  73.3
향단  70  60  80  70.00  70.0
방자  30  80  70  60.00  60.0

In [95]:
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
df.T[['춘향']]

         춘향
국어    80.00
영어    90.00
수학    90.00
평균점수  86.67
평균    86.70

In [99]:
# (5) 춘향의 점수 DF출력 ver2.

    국어  영어  수학   평균점수    평균
춘향  80  90  90  86.67  86.7

In [97]:
# (6) 향단의 점수를 시리즈로 나타낸다
df.T['향단']

국어      70.0
영어      60.0
수학      80.0
평균점수    70.0
평균      70.0
Name: 향단, dtype: float64